{"name":"Naman","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Naman Mathur - curious","headerTaglineThree":"designer and devloper","headerTaglineFour":" based in Dehradun, India.","showCursor":true,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/nikku0009"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/naman-mathur09/"},{"id":"4","title":"Email","link":"mailto:naman10mathur@gmail.com"}],"projects":[{"id":"1","title":"Automatic Number Plate Recognition System","description":"License Plate Recognition using yolo, Open CV, Tesseract OCR. Used object detection techniques like cropping, preprocessing, and ran it through tesseract OCR to output plate number and integrated sql database with it.","imageSrc":"https://i.postimg.cc/SQ7bnGJw/1910-i029-018-realistic-car-number-set.jpg","url":"https://github.com/nikku0009/ANPR"},{"id":"2","title":"Secure File Storage Using Hybrid Cryptography","description":"AES, RSA, DES algorithms are used for encryption and decryption. The application of cryptography will convert datasets into unreadable form. Python was used for backend and HTML, CSS were used for frontend, Github was used for version control","imageSrc":"https://i.postimg.cc/0yHs82bj/55296.jpg","url":"https://github.com/nikku0009/Secure-Shield"},{"id":"3","title":"Covid Tracker","description":"Developed a COVID Tracker application using Java and Thymeleaf to provide realtime updates.","imageSrc":"https://i.postimg.cc/667BTZdK/4268638.jpg","url":"https://github.com/nikku0009/covid-tracker"},{"id":"4","title":"Chat Application","description":"Implemented Socket.IO and used HTML, CSS, JavaScript, and Node.js, to create an interactive and user-friendly interface.\tEmployed responsive web design principles to ensure a consistent user experience across various devices and screen sizes.","imageSrc":"https://i.postimg.cc/RZhdzvkg/3156814.jpg","url":"https://chatlab.netlify.app/"},{"id":"5","title":"Cryptocurrency Exchange Application","description":"Connected the app to blockchain, did metamask pairing and interaction with smart contracts and created a UI to record and display transactions. The user can send Ethereum through the blockchain network","imageSrc":"https://i.postimg.cc/BQg70YXn/6242196.jpg","url":"https://lobster-app-cy9gv.ondigitalocean.app/"},{"id":"6","title":"Weather Application","description":" Developed a web application which provides real-time weather information and forecasts. ntegrated with the weather API called OpenWeatherMap to fetch weather data for different locations.","imageSrc":"https://i.postimg.cc/C1B9Mj96/3366845.jpg","url":"https://climacheck.netlify.app/"},{"id":"c3fc1254-6de0-47b7-af1a-37dc6fdde6de","title":"Blog Site","description":"A site made for writing blogs using HTML, CSS and Javascript","imageSrc":"https://i.postimg.cc/4yK8QsXL/20943790.jpg","url":"https://monthly-resolution.netlify.app/"},{"id":"8bd1278c-eb57-4601-956c-e887e3d08cbb","title":"Dog Rental Website","description":" Experience the joys of having a four-legged friend without the long-term responsibilities.  The site was made using HTML, CSS and Javascript. Mediaqueries were used for responsive design","imageSrc":"https://i.postimg.cc/HkWv3VQx/3901355.jpg","url":"https://dog-rental.netlify.app/"},{"id":"341a27cf-467f-44b1-b650-04abcace14e5","title":"Tech Talk ","description":"A site made for catching up on sessions done by UCD. UI was made in figma and the tech stack used was HTML,CSS, JavaScript and PHP.","imageSrc":"https://i.postimg.cc/bNPt25n0/6029655.jpg","url":"https://tech-talk-ucd.netlify.app/"},{"id":"754e96f2-6cb4-45bb-970e-ea6ab5fd7c20","title":"UCD UPES","description":"Social media landing page for college club United Club of Developers","imageSrc":"https://i.postimg.cc/ry7KSPtZ/3847762.jpg","url":"https://ucdupes.netlify.app/"},{"id":"6cbbd8c7-19f4-4902-822b-762c949ecfcf","title":"Dash Design ","description":"Web Design & Development","imageSrc":"https://i.postimg.cc/ry7KSPtZ/3847762.jpg","url":"https://dashdesign.netlify.app/"}],"services":[{"id":"2","title":"Branding","description":"I design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."},{"id":"3","title":"Web Design","description":"I build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"4","title":"Video Editing","description":"I am committed to providing you with unparalleled editing solutions that cater to your unique needs and vision."}],"aboutpara":"Hello! I'm Naman Mathur, a passionate and driven individual with a strong foundation in Computer Science Engineering. Currently pursuing my B.Tech degree in Computer Science Engineering at UPES, I have dedicated myself to honing my skills as a Full Stack Developer.\n\nMy love for technology and its endless possibilities led me to specialize in both front-end and back-end development, allowing me to create robust and user-friendly web applications. With a keen eye for detail and a problem-solving mindset, I strive to deliver innovative solutions that meet and exceed user expectations.\n\nDuring my academic journey, I discovered my fascination with Machine Learning, which led me to pursue a minor in the field. Exploring the realm of AI and data-driven insights has been an exciting endeavor, and I look forward to leveraging this knowledge to enhance the capabilities of software systems.\n\nTo gain real-world experience, I had the privilege of interning at esteemed companies like IBM and Cello. These experiences exposed me to diverse projects and collaborative environments, where I learned to work effectively within a team, meet deadlines, and tackle complex challenges head-on.\n\nI am a constant learner, always eager to explore emerging technologies and stay up-to-date with industry trends. I believe in continuous improvement and actively seek opportunities to enhance my skills, whether it's attending workshops, participating in hackathons, or taking online courses.\n\nOutside of my professional interests, I enjoy engaging in various hobbies, including reading tech blogs, playing sports, and volunteering for community initiatives. These experiences have enriched my perspective and instilled in me a sense of empathy and dedication to making a positive impact on the world.\n\nAs I look forward to new opportunities and challenges, I am excited to contribute my skills, passion, and expertise to make meaningful contributions to the tech industry and beyond. Feel free to connect with me to explore potential collaborations or share insights about the ever-evolving world of technology!","resume":{"tagline":"👋  I'm a software engineer,UI/UX designer, video editor","description":"Strong in design and integration with intutive problem solving skills. Proficient in C++,Java and SQL. Passionate about implementing creating new projects","experiences":[{"id":"1","dates":"June 2023 - July 2023","type":"Full Time","position":"Project Intern at IBM","bullets":"Developed and implemented a backup and version control system utilizing Amazon Web Services . Utilized services such as Amazon S3, AWS Lambda, AWS Backup, and AWS DataSync .Worked closely with the project manager and team members to meet project milestones"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"July 2020 - March 2022","type":"Full Time","position":"IT Administrative Intern at Cello Industries Pvt Ltd","bullets":"Assisted with basic troubleshooting of hardware and software issues such as resetting passwords, connecting devices to the network, and installing software. Assisted in the maintenance and monitoring of IT equipment, including printers, scanners, LAN and other peripheral devices and managed attendance via SQL"}],"education":{"universityName":"UPES","universityDate":"2020-2024","universityPara":"I'm pursuing B.Tech in Computer Science and Engineering with Cloud Computing and Virtualization Technology as my major, Artificial Intelligence and Machine Learning as my Minor and UI/UX as my major"},"languages":["Javascript","HTML5","CSS","Python","C","C++","Java","Solidity","Prolog","PHP"],"frameworks":["React","Spring MVC","NodeJs"],"others":["Figma","Adobe Premiere Pro","AWS","Microsoft Azure"]}}